# Polygonize

## Description
Polygonize polylines and polygons.

```pascal
FUNCTION Polygonize(
				h                  : HANDLE;
				segmentationLength : REAL;
				polygonizeStraight : BOOLEAN): HANDLE;
```

```python
def vs.Polygonize(h, segmentationLength, polygonizeStraight):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|   |
|segmentationLength|REAL|   |
|polygonizeStraight|BOOLEAN|   |

## Version
Availability: from Vectorworks 2018

## Category
* Graphic Calculation